slides/03_state_tr.tex
% Created 2015-06-13 Sat 08:28
\documentclass[presentation]{beamer}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usetheme{Rochester}
\author{Ustun Ozgur}
\date{2015-06-13 Cumartesi}
\title{State}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 24.4.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle

\begin{frame}[fragile,label=sec-1]{State}
 \begin{itemize}
\item Değişken verili uygulamalar
\item İki önemli metod: \texttt{getİnitialState} ve \texttt{setState}
\item \texttt{setState}: girdiyle şu anki state'i birleştirir
\item Ayrıca \texttt{replaceState}, şu anki state'i girdi ile değiştirir
\item state'e render metodundan şu şekilde erişilir \texttt{this.state}
\end{itemize}
\end{frame}

\begin{frame}[fragile,label=sec-2]{Örnek: Sayaç}
 \begin{verbatim}
var Counter = React.createClass({

  getInitialState: function () {
    return {counter: 0};
  },
  increment: function () {
    this.setState({counter: this.state.counter + 1});
  },
  render: function () {
    return <div onClick={this.increment}>
      Counter value is {this.state.counter}
    </div>;

  }

});
\end{verbatim}
\end{frame}

\begin{frame}[label=sec-3]{Genel Bakış}
\begin{itemize}
\item Bir tane `onClick` handler var. Bu `setState`'i çağırıyor, birer birer artırarak
\item Bu React ile değişken veri (state) yönetiminin özüdür.
\end{itemize}
\end{frame}

\begin{frame}[label=sec-4]{State'i Çocuklara Props olarak Geçirmek}
\begin{itemize}
\item Bir sahip (ana) bileşen (owner component), state'ini çocuklara props olarak geçirebilir.
\item Bir bileşenin state'i bir diğerinin props'udur.
\end{itemize}
\end{frame}

\begin{frame}[fragile,label=sec-5]{Örnek: Sayaçlar: Sayaç Bileşeni}
 \begin{verbatim}
var Counter = React.createClass({
  render: function () {
    return <div>
      Counter value is {this.props.counter}
      <button onClick={this.props.click}>Increment</button>
      </div>
  }

});
\end{verbatim}
\end{frame}

\begin{frame}[fragile,label=sec-6]{Örnek: Sayaçlar Bileşeni}
 \begin{verbatim}
var Counters = React.createClass({
  getInitialState: function () {
    return {counter1: 10, counter2: 0};  },
  incrementCounter1: function () {
    this.setState({counter1: this.state.counter1 + 1,
                   counter2: this.state.counter2 - 1})  },
  incrementCounter2: function () {
    this.setState({counter1: this.state.counter1 - 1,
                   counter2: this.state.counter2 + 1})  },
  render: function () {
    return <div>
      <Counter click={this.incrementCounter1}
       counter={this.state.counter1}/>
      <Counter click={this.incrementCounter2}
       counter={this.state.counter2}/>
      </div>  }})
\end{verbatim}
\end{frame}

\begin{frame}[fragile,label=sec-7]{bind kullanan daha kısa versiyonu}
 \begin{verbatim}
var Counters = React.createClass({
  getInitialState: function () {
    return {counter1: 10, counter2: 0};    },
  incrementCounter: function (increment) {
    this.setState({
      counter1: this.state.counter1 + increment,
      counter2: this.state.counter2 - increment})    },
  render: function () {
    return <div>
      <Counter
       click={this.incrementCounter.bind(this, 1)}
       counter={this.state.counter1}/>
      <Counter
       click={this.incrementCounter.bind(this, -1)}
       counter={this.state.counter2}/>
      </div>    }})
\end{verbatim}
\end{frame}


\begin{frame}[label=sec-8]{Özet}
\begin{itemize}
\item Çocuk bileşenler hiçbir zaman props'ları doğrudan değiştirmez.
\item Ana bileşene bir olay olduğunu props olarak geçirilen fonksiyonlar ile haber
verirler.
\item Ana bileşen state'i değiştirir.
\item React state'i aşağı doğru props olarak aktarır.
\item Her şey yeni baştan görüntülenir (render edilir).
\end{itemize}
\end{frame}

\begin{frame}[label=sec-9]{Alıştırma:}
\begin{itemize}
\item Todo uygulamasını liste öğeleri state'te olacak şekilde değiştirin.
\item Todo bileşenlerinin tamamlanmış/tamamlanmamış özelliğini tamamlayın.
\item İpucu: todo elemanları bir string listesi gibi mi tutulmalı, bir nesne
listesi olarak mı?
\item Bitmiş/bitmemiş şeklindeki filtreleri tamamlayın.
\item İpucu: Filtrenin şu an aktif olup olmadığını bir state değişkeni ile izleyin.
\item Bir todo elemanının listeden çıkarılmasını tamamlayın.
\item Kalan eleman sayısının gösterilmesi özelliğini gerçekleştirin.
\end{itemize}
\end{frame}
% Emacs 24.4.1 (Org mode 8.2.10)
\end{document}
